-- phpMyAdmin SQL Dump
-- version 4.4.15.7
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Фев 20 2017 г., 13:17
-- Версия сервера: 5.6.31
-- Версия PHP: 5.6.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `carRepair`
--

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE IF NOT EXISTS `news` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `short_content` text NOT NULL,
  `content` text NOT NULL,
  `author_name` varchar(255) NOT NULL,
  `type` int(11) NOT NULL DEFAULT '1'
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `title`, `date`, `short_content`, `content`, `author_name`, `type`) VALUES
(1, 'Новое видео Death Stranding шокировало геймеров', '2016-12-02 10:27:58', 'Хидэо Кодзима (Hideo Kojima) привез на The Games Awards 2016 небольшой подарок всем геймерам. Во время церемонии создатели Death Stranding представили новое видео таинственной игры, которое ввергло публику в шок.', 'Кодзима (Hideo Kojima) привез на The Games Awards 2016 небольшой подарок всем геймерам. Во время церемонии создатели Death Stranding представили новое видео таинственной игры, которое ввергло публику в шок.\r\n\r\nКак стало известно Gamebomb.ru, в новом ролике показали персонажа, который, судя по всему, пытается укрыть младенца в искусственном инкубаторе от многочисленных военных. Однако в подземной сети тоннелей, куда он направляется, его уже поджидают. Главный антогонист, наделенный таинственными способностями держать солдат на привязи, направляет своих безмолвных подчиненных прямо к беглецу.', '1Елена Милая', 1),
(2, 'Появилась возможность экстремального тест-драйва Kia Sportage', '2016-12-02 10:34:09', 'В ближайшие выходные, 2-3 декабря, «Автоцентр» дает возможность протестировать две версии нового Kia Sportage в эстремальных условиях украинской зимы\r\n', 'Во время проведения первого этапа «народных тест-драйвов» популярного кроссовера Kia Sportage, который состоится 3 и 4 декабря 2016 года, синоптики обещают в столице снегопад. Именно такая погода должна в полной мере показать преимущества полноприводных версий кроссоверов Kia Sportage.', ' Сергей Матусяк', 1),
(3, 'Снегопад в Киеве: в город не пускают грузовики', '2016-12-02 10:39:26', 'В Киеве утром в пятницу, 2 декабря, на дорогах зафиксированы 5-балльные заторы.', 'Как сообщает пресс-служба КГГА, в связи с ухудшением погодных условий 2 декабря ограничен въезд крупногабаритного транспорта в столицу.\r\n\r\n"Начало действия ограничения запланировано на 6 утра. Патрульная полиция будет регулировать въезд в город грузовиков, чтобы они не создавали помехи для работы снегоуборочной техники", - заявили в КГГА.', 'Лариса Ившина', 1),
(4, 'С 1 декабря в Украине подорожала телефонная связь', '2016-12-02 10:41:48', 'Национальная комиссия, осуществляющая государственное регулирование в сфере связи и информатизации (НКРСИ), с 1 декабря 2016 года повысила максимальные размеры тарифов на услуги фиксированной связи!', 'Согласно сообщению НКРСИ, соответствующее решение регулятора Министерство юстиции Украины зарегистрировало 16 ноября, а 1 декабря оно было опубликовано в газете "Урядовый курьер" и вступило в силу.\r\n\r\nТаким образом, с 1 декабря 2016 года для населения и бюджетных организаций абонентская плата за пользование стационарным телефоном в городах и районных центрах составит 40,93 грн/мес. без почасовой оплаты и 39,31 грн/мес. с почасовой оплатой. Население поселков городского типа и сел будет платить за стационарную связь 34,74 грн/мес. без почасовой оплаты и 33,12 грн/мес. с почасовой оплатой. Для небюджетных организаций в городах и районных центрах плата за пользование стационарным телефоном вырастет до 50,96 грн/мес. без почасовой оплаты и до 50,62 грн/мес. с почасовой оплатой. При этом для небюджетных организаций в сельской местности абонплата увеличится до 48,52 грн/мес. без почасовой оплаты и до 42,48 грн/мес. с почасовой оплатой.', 'Алампиев Денис', 1),
(5, 'Штучний інтелект написав дивну різдвяну пісню', '2016-12-02 10:44:32', 'Розробники з університету Торонто створили штучний інтелект, здатний складати пісню про предмети на фотографіях', 'Про це повідомляє The Guardian. Йому показали знімок різдвяної ялинки і він в режимі реального часу написав мелодію та підібрав до неї слова. Спершу нейромережу створювали для генерації поп-композицій. Її навчали за допомогою бази, що складається зі 100 годин музики.\r\n\r\nНезабаром програма змогла писати прості мелодії, а потім і підбирати до них слова. Основою словникового запасу став 51 годину аудіозаписів текстів пісень. Розробники залишали лише часто повторювані слова, тому словниковий запас штучного інтелекту склав тільки всього 3390 слів.\r\n\r\nПізніше нейромережу навчили розуміти, як певні фрази пов''язані із зображеними на фото. Автори використовували знімки зі спеціальними позначками. Це підказувало штучного інтелекту, що зображено на картинці.\r\n\r\nУ майбутньому розробники хочуть, щоб нейромережу освоїла різні музичні інструменти і писала складні композиції.\r\n\r\nНагадаємо, портал "Знай.ua" повідомляв, інженери створили робота, який полюватиме у відкритому морі за підводними човнами. Він отримав назву Sea Hunter і успішно пройшов випробування.', 'Олександр Майер', 1),
(6, 'Джей Ло похизувалася ідеальним тілом у 47 років', '2016-12-02 10:47:07', 'Багато користувачів мережі захоплюються дівчиною і ставлять її в приклад.', 'Американська актриса, співачка, танцівниця, модельєр, продюсер і бізнес-вумен Дженніфер Лопес порадувала шанувальників і підписників у соціальній мережі instagram новим красивим знімком. 47-річна Джей Ло активно слідкує за собою та зовсім не виглядає на свій вік.\r\n\r\nЦього разу красуня опублікувала в соцмережі фотографію, на якій біля басейну позувала у відвертому купальнику, що підкреслив її спортивне підтягнуте тіло і апетитні форми.\r\n\r\nФото розбурхало шанувальників. За досить короткий час знімок набрав 663 тисячі лайків і величезну кількість хвалебних коментарів.', 'Олена Сафронова', 1),
(10, 'ытпраряваршра', '2017-02-16 14:21:08', 'вапрулорафоалфаола', '2', '', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `price`
--

CREATE TABLE IF NOT EXISTS `price` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `availability` int(11) NOT NULL DEFAULT '1',
  `trade_price` float NOT NULL,
  `retail_price` float NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `price`
--

INSERT INTO `price` (`id`, `name`, `description`, `availability`, `trade_price`, `retail_price`) VALUES
(1, 'Lorem ipsum', 'Lorem ipsum', 1, 25, 27.32),
(2, 'Dolor sit amet', 'Scing elitr, sed', 1, 18, 19.23),
(3, 'Diam nonumy', 'Consetetur sadip', 1, 35.24, 38),
(4, 'Scing elitr', 'Eirmod tempor', 0, 52.24, 54.8),
(5, 'Diam nonumy', 'Invidunt ut labore', 0, 11.4, 12),
(6, 'Eirmod tempor', 'Dolore magna', 0, 42.5, 44),
(7, 'Lorem ipsum', 'Consetetur sadip', 1, 12, 12.8),
(8, 'Dolor sit amet', 'vScing elitr, sed', 1, 27.12, 29.9),
(9, 'Consetetur sadip', 'Diam nonumy', 1, 24, 24.87),
(10, 'Eirmod tempor', 'Scing elitr, sed', 1, 66.34, 69.1),
(11, 'Diam nonumy', 'Invidunt ut labore', 1, 11.56, 13.05),
(12, 'Eirmod tempor', 'Dolore magna', 1, 17.7, 19.25),
(13, 'Lorem ipsum', 'Consetetur sadip', 1, 9.55, 10.95),
(14, 'Dolor sit amet', 'Scing elitr, sed', 1, 13.4, 14.75),
(16, 'sdfghj', 'dfgfdhgjhk,j23', 0, 23, 25),
(19, '1', '1', 1, 12, 12);

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` varchar(50) NOT NULL,
  `comment` text NOT NULL,
  `comment_type` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `name`, `email`, `password`, `role`, `comment`, `comment_type`) VALUES
(3, 'Александр', 'alex@mail.com', '111111', '', 'Lorem ipsum dolor sit amet, consetetur sadipscing', 1),
(4, 'Victor', 'zinchenko.us@gmail.com', '222222', '', 'Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy ', 1),
(5, 'Сергей', 'serg@mail.com', '111111', '', 'Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ', 1),
(6, 'kotovozka', 'kotovozka@mail.com', '1234567890', 'admin', 'ASASASASDASD', 1),
(7, 'jora_kornev', 'kornev@mail.com', '000000000000', '', 'asd asd asd asd', 1),
(8, 'valera', 'leontiev@mail.com', '000000000000', '', '', 0),
(9, 'kolya', 'piterskiy@mail.com', '0987654321', '', '', 0),
(10, 'krevetka', 'biber@mail.com', '121212', '', '', 0),
(11, 'Petro', 'gavenkar@mail.com', '1212121212', '', '', 0),
(12, 'sadh', 'afsgdhfm@dfghm.com', 'dafsgdhf', '', '', 0),
(13, 'jeka', 'slesar@mail.com', '12121212', '', '', 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `price`
--
ALTER TABLE `price`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT для таблицы `price`
--
ALTER TABLE `price`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=20;
--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=14;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
